#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for DEV Non-Live Deployment</summary>

```

terraform
aws_security_group.allow_tls: Refreshing state... [id=sg-028b9dea7a79ac792]
aws_api_gateway_rest_api.utils: Refreshing state... [id=gctqk6bw2j]
aws_api_gateway_deployment.deployment: Refreshing state... [id=b8y70i]
module.api_s3_audit_post.aws_api_gateway_resource.api_root: Refreshing state... [id=u550gd]
module.api_s3_audit_post.aws_api_gateway_method.proxy: Refreshing state... [id=agm-gctqk6bw2j-cremaqz97d-POST]
module.api_s3_audit_post.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-gctqk6bw2j-cremaqz97d-POST]
module.api_s3_audit_post.aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-gctqk6bw2j-cremaqz97d-POST-200]
aws_api_gateway_stage.deployment: Refreshing state... [id=ags-gctqk6bw2j-dev]
module.api_s3_audit_post.aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-gctqk6bw2j-cremaqz97d-POST-200]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api_s3_audit_post.aws_api_gateway_integration.lambda_integration must be replaced
-/+ resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "cremaqz97d" -> (known after apply)
      ~ id                      = "agi-gctqk6bw2j-cremaqz97d-POST" -> (known after apply)
      + integration_http_method = "POST" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.api_s3_audit_post.aws_api_gateway_integration_response.proxy will be created
  + resource "aws_api_gateway_integration_response" "proxy" {
      + http_method = "POST"
      + id          = (known after apply)
      + region      = "eu-west-1"
      + resource_id = "cremaqz97d"
      + rest_api_id = "gctqk6bw2j"
      + status_code = "200"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rgrhodesdev, Action: `pull_request`*